
# הפקודה להדפסה היא  print

# הפקודה יורדת שורה בסוף הביצוע
#--------------------------------------
print ('hello world')


# הדפסת טקסט מספר פעמים - במקרה הבא הטקסט יודפס 5 פעמים
# הפלט יהיה
# hellohellohellohellohello
#--------------------------------------
print ('hello'*5)



# ביצוע חישובים בפקודת ההדפסה
# הפקודה הבאה תדפיס  את המספר 45
print( 9*5)


# שימו לב שפסיק מייצג רווח בהדפסה
# ומאפשר הדפסה של מספר נתונים באותה שורה
# שימו לב שהפקודה יורדת שורה בסוף הביצוע
#----------------------------------------------------

print ('hello','world')


# במידה ונרצה להדפיס רווח לאחר ההדפסה ולא נרצה לרדת שורה 
#  יש לבצע  זאת באופן הבא
#----------------------------------------------------

print ('hello','world',end=' ')

# במידה ונרצה להדפיס תו אחר במקום לרדת שורה 
#  הפלט יהיה
#  hello#world#
#----------------------------------------------------

print ('hello','world',end='#')


# הדפסה של טקסט עם מספר
#----------------------------------------------------
print ('hello class ' +  str(9))

