t = (1,2,3)


# כתוב פקודה להצגת האיבר השלישי ב-tuple הבא: fruits = ('apple', 'banana', 'cherry').
fruits = ('apple', 'banana', 'cherry')
print(fruits[2])


# כתוב פקודה ליצירת tuple ריק.
t2 = ()


# כתוב פקודה לבדיקת כך האם הערך 5 קיים ב-טאפל הבא: numbers = (1, 3, 5, 7, 9).
numbers = (1, 3, 5, 7, 9)
if 5 in numbers:
  print(True)



# כתוב פקודה ליצירת namedtuple בשם Person עם שדות שם פרטי ושם משפחה.
namedtuple = ('tomer','tubi')
print(namedtuple)

# כתוב פקודה  אשר תדפיס את כל האיברים ב-טאפל חוץ מהאיבר האחרון.
print(t[:-1])
# או
print(t[:len(t)-1])


# כתוב פקודה  אשר תדפיס את גודל ה-טאפל.
print(len(t))


# כתוב פקודה  אשר תדפיס את כל האיברים ב-טאפל המקורי למעט האיבר הראשון.
print(t[1:])
# או
print(t[1:])


# כתוב פקודה אשר תחליף את האיבר הראשון ב-טאפל ותדפיס את המצב החדש
# שימו לב שהפקודה מייצרת טאפל חדש, מכיוון שאי אפשר לשנות את איברי הטאפל
# כמו כן יש להוסיף פסיק בסוף הטאפל שמחברים , אחרת לא ניתן ליצור טאפל חדש
new_t= t[1:] + (6,)
print(new_t)
