
import queue    # קריאה לספריה של תור

q = queue.Queue()   # יצירת-תור-ריק

q.put(ערך_שנרצה_להכניס_לתור)   # הכנסה-לתור

q.get()   # הוצאה-מהתור

if q.empty():   # בדיקה-האם-התור-ריק?
  print('empty queue')


# דוגמא לפעולה ולזימון
# זימון הפעולה , יש ליצור תור ואז להעביר אותו לפעולה
# שימו לב שנעשה כאן שימוש בפעולה שלא קיימת בשפה אלא נכתבה במיוחד לתכנית הבדיקה
def example(temp_queue):
    item = q.get()
    print(item)  
example(create_queue([1,2,3])

#   מעבר על האיברים בתור ללא שמירת האיברים בתור
# יש לשים לב שבסוף הריצה התור יהיה ריק
while not q.empty():
  item = q.get()
  print(item)


#  מעבר על האיברים בתור ושמירת האיברים
# יש לשים לב שאנו שומרים את האיברים שמחקנו 

length = q.qsize()
for i in range(length):
  item = q.get()   # נוציא את האיבר בראש התור
  print(item)      # נדפיס את האיבר 
  q.put(item)      # נחזיר אותו לסוף התור
    

